##https://www.coursera.org/learn/python-osnovy-programmirovaniya/programming/wAYQg/kolichiestvo-slov

# Количество слов
# Дана строка, состоящая из слов, разделенных пробелами. Определите,
# сколько в ней слов.

print(input().count(' ') + 1)
