##https://www.coursera.org/learn/python-osnovy-programmirovaniya/programming/43Rfn/zamiena-podstroki

# Замена подстроки
# Дана строка. Замените в этой строке все цифры 1 на слово one.


print(input().replace('1', 'one'))
