# https://www.coursera.org/learn/python-osnovy-programmirovaniya/programming/xnqKn/udalieniie-simvola

# Удаление символа
# Дана строка. Удалите из этой строки все символы @.


print(input().replace('@', ''))
