# https://www.coursera.org/learn/python-osnovy-programmirovaniya/programming/tc30E/drobnaia-chast/submission

# Дробная часть
# Дано положительное действительное число X. Выведите его дробную часть.

x = float(input())
print(x - int(x))
