# https://www.coursera.org/learn/python-osnovy-programmirovaniya/programming/YbGN8/posliedniaia-tsifra

# Последняя цифра
# Дано натуральное число. Выведите его последнюю цифру.

number = int(input())
print(number % 10)
