# https://www.coursera.org/learn/python-osnovy-programmirovaniya/programming/Uiu4Y/stiepien-dvoiki

# Степень двойки
# Вводится целое неотрицательное число N (N≤100).
# Выведите 2ᴺ.

number = int(input())
print(2 ** number)
