# https://www.coursera.org/learn/python-osnovy-programmirovaniya/programming/z0sAY/piervaia-tsifra-dvuznachnogho-chisla

# Первая цифра двузначного числа
# Дано положительное двузначное число. Найдите число десятков в нем.

number = int(input())
print(number // 10)
