# https://www.coursera.org/learn/python-osnovy-programmirovaniya/programming/homk5/stavki

# Ставки

# Перед началом тараканьих бегов всем болельщикам было предложено сделать по
# две ставки на результаты бегов. Каждая ставка имеет вид "Таракан №A придет
# раньше, чем таракан №B". Организаторы бегов решили выяснить, могут ли тараканы
# прийти в таком порядке, чтобы у каждого болельщика сыграла ровно одна ставка
# из двух (то есть чтобы ровно одно из двух утверждений каждого болельщика
# оказалось верным). Считается, что никакие два таракана не могут прийти к
# финишу одновременно.
