# https://www.coursera.org/learn/python-osnovy-programmirovaniya/programming/FRKcG/maksimum-iz-dvukh

# Максимум из двух
# Напишите программу, которая считывает два целых числа A и B и выводит наибольшее значение из них. 
# Числа — целые от 1 до 1000.


n = int(input())
m = int(input())
max = n

if m > n:
    max = m

print(max)
